function myPow(x, n) {
    // Випадок, коли n дорівнює 0
    if (n === 0) {
      return 1;
    }
  
    // Випадок, коли n від'ємне
    if (n < 0) {
      x = 1 / x;
      n = -n;
    }
  
    // Поділ ступеня піднесення на пів
    if (n % 2 === 0) {
        return myPow(x * x, n / 2);
      } else {
        return x * myPow(x * x, (n / 2) | 0);   //побітовий оператор OR, для швидкого округлення 
     }
  }
  
// Виведення результату
console.log(myPow(2, 0));        // Виведе 1
console.log(myPow(2.00000, 10)); // Виведе 1024
console.log(myPow(2.10000, 3));  // Виведе 9.261000000000001
console.log(myPow(2.00000, -2)); // Виведе 0.25
